Revit 2027 API
SpecTypeId.LinearForceScale Property
 Linear Force Scale, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LinearForceScale { get; }
Public Shared ReadOnly Property LinearForceScale As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LinearForceScale {
	ForgeTypeId^ get ();
}
static member LinearForceScale : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace